import pandas as pd

# 仮のデータを作成
data1 = {
    '選手名': ['ハフィーニャ', 'レヴァンドフスキ', 'ヤマル', 'ガビ', 'ペドリ', 'デヨング', 'バルデ', 'クンデ', 'クバルシ', 'マルティネス', 'シュチェスニー'],
    'ポジション': ['FW','FW','FW','MF','MF','MF','DF','DF','DF','DF','GK'],
    '得点数': [2, 1, 2, 1, 1, 0, 0, 0, 0, 0, 0],
    'アシスト数': [1, 1, 1, 1, 2, 1, 0, 0, 0, 0, 0],
    'パス成功率': [88.5, 87.0, 85.0, 92.5, 95.0, 96.5, 82.0, 85.5, 83.0, 83.0,85.0],
    '走行距離': [13.3, 9.5, 10.5, 14.4, 14.0, 10.5, 14.0, 13.7, 9.3, 8.9, 2.0],
    'ロングパス成功率': [None, None, None, 42.0, 62.8, 69.5, 10.0, 60.0, 50.5, 65.0, 75.0],
    'クロス成功率': [42.0, None, 61.0, 53.0, 56.0, None, 28.0, 46.0, None, None, None,]
}
# 仮のデータを作成
data2 = {
    '選手名': ['ノア', 'ローガン', 'セオ', 'ウィリアル', 'ジョセフ', 'ライリー', 'イライジャ', 'ルーベン', 'サミュエル', 'マスティフ', 'アルバード'],
    'ポジション': ['FW','FW','MF','MF','MF','MF','DF','DF','DF','DF','GK'],
    '得点数': [3, 0, 1, 2, 0, 1, 1, 0, 0, 2, 0],
    'アシスト数': [2, 0, 0, 1, 0, 1, 0, 2, 0, 0, 1],
    'パス成功率': [87.5, 83.0, 89.5, 90.5, 92.0, 94.0, 81.0, 86.0, 91.0, 88.5,85.0],
    '走行距離': [15.1, 7.3, 11.6, 17.5, 12.0, 12.1, 13.4, 13.3, 8.9, 7.5, 2.3],
    'ロングパス成功率': [None, None, None, 52.0, 61.1, 67.2, 11.7, 60.5, 49.7, 64.1, 76.4],
    'クロス成功率': [40.1, None, 55.0, 57.4, 59.1, None, 26.9, 48.6, None, None, None,]
}

# データフレームを作成
df = pd.DataFrame(data1,data2)


#formatted_output = df.to_string(
#    index=False,
#    justify="center",  # 列をセンター寄せ
#    col_space=10,  # 各列の幅を調整
#    header=True  # 列名を表示
#)

# CSVに保存
df.to_csv('players_stats.csv', index=False)

# データの読み込み
df = pd.read_csv('players_stats.csv')

#test